In [45]:
import pandas as pd

In [46]:
data = {
    'isim': ['Ahmet', 'Ayşe', "Mehmet", 'Ahmet'],
    'yaş': [25, 30, None, None],
    'şehir': ['İstanbul', 'Ankara', 'İzmir', "İstanbul"]
}

In [47]:
df = pd.DataFrame(data)

In [48]:
df

     isim   yaş     şehir
0   Ahmet  25.0  İstanbul
1    Ayşe  30.0    Ankara
2  Mehmet   NaN     İzmir
3   Ahmet   NaN  İstanbul

## isna, dropna ve fillna

In [49]:
df.isna()

    isim    yaş  şehir
0  False  False  False
1  False  False  False
2  False   True  False
3  False   True  False

In [32]:
df.dropna()

    isim   yaş     şehir
0  Ahmet  25.0  İstanbul
1   Ayşe  30.0    Ankara

In [51]:
df.fillna(value ={"yaş": df["yaş"].mean().round()})

     isim   yaş     şehir
0   Ahmet  25.0  İstanbul
1    Ayşe  30.0    Ankara
2  Mehmet  28.0     İzmir
3   Ahmet  28.0  İstanbul